#### Terraform Format and Style :`success`
#### Terraform Initialization :`success`
#### Terraform Validation :`success`
#### Checkov :`success`

<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan :
<details><summary>Show Plan</summary>
```
random_integer.name_suffix: Refreshing state... [id=63605]
azurerm_resource_group.app_service: Refreshing state... [id=/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/rg-cloudinfra-dev]
azurerm_service_plan.app_service: Refreshing state... [id=/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/rg-cloudinfra-dev/providers/Microsoft.Web/serverFarms/asp-cloudinfra-dev]
azurerm_windows_web_app.app_service: Refreshing state... [id=/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/rg-cloudinfra-dev/providers/Microsoft.Web/sites/app-cloudinfra-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service_source_control.app_source_control will be created
  + resource "azurerm_app_service_source_control" "app_source_control" {
      + app_id                 = "/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/rg-cloudinfra-dev/providers/Microsoft.Web/sites/app-cloudinfra-dev"
      + branch                 = "main"
      + id                     = (known after apply)
      + repo_url               = "https://github.com/raradhye/cloud-infra-automation"
      + rollback_enabled       = false
      + scm_type               = (known after apply)
      + use_local_git          = false
      + use_manual_integration = true
      + use_mercurial          = false
      + uses_github_action     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```          
</details>
<details><summary>Show Checkov Results</summary>


---
</details>          

*Pusher: @raradhye, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*